const wordList = [
    {
        word: "الكفن",
        hint: "ماهو الشيء الذي اذا رأيته لاترتديه,واذا ارتديته لاتره"
    },
    {
        word: "الساعة",
        hint: "شيء لايكذب إطلاقا الا اذا شعر بالجوع"
    },
    {
        word: "ماءمتجمد",
        hint: "كيف يمكن للغربال حمل الماء"
    },
    {
        word: "الثعبان",
        hint: "ليس له أذن ويشم بلسانه"
    },
    {
        word: "جدأبأبن",
        hint: "تم اصطياد ثلاث ارانب من قبل والدينوابنين ولكل منهم ارنب"
    },
    {
        word: "الهواء",
        hint: "شيء موجود في كل بقاع الارض"
    },
    {
        word: "حرفاللام",
        hint: "شيء يتكرر في الليل ثلاث مرات فما هو"
    },
    {
        word: "النملة",
        hint: "من الذي حزر قومه وهو ليس الأنس ولامن الجن"
    },
    {
        word: "التاريخ",
        hint: "دراسة الأحداث الماضية والحضارة الإنسانية"
    },
    {
        word: "البيتزا",
        hint: "طبق مالح مستدير مع الاضافات"
    },
    {
        word: "الجاز",
        hint: "نوع من الموسيقى يتميز بالارتجال والإغماء."
    },
    {
        word: "الكميرا",
        hint: "جهاز يستخدم لالتقاط وتسجيل الصور أو مقاطع الفيديو."
    },
    {
        word: "الماس",
        hint: "حجر كريم ثمين معروف بتألقه وصلابته."
    },
    {
        word: "مغامرة",
        hint: "تجربة مثيرة أو جريئة"
    },
    {
        word: "العلوم",
        hint: "الدراسة المنهجية لبنية وسلوك العالم المادي والطبيعي."
    },
    {
        word: "مسكليت",
        hint: "مركبة تعمل بالطاقة البشرية ذات عجلتين."
    },
    {
        word: "غروب",
        hint: "اختفاء الشمس يوميا تحت الأفق."
    },
    {
        word: "القهوة",
        hint: "مشروب شعبي يحتوي على الكافيين مصنوع من حبوب البن المحمصة."
    },
    {
        word: "الرقص",
        hint: "غالبًا ما يتم أداء حركة إيقاعية للجسم مع الموسيقى."
    },
    {
        word: "مجرةالفضائية",
        hint: "نظام واسع من النجوم والغاز والغبار متماسك معًا بواسطة الجاذبية."
    },
    {
        word: "أوركسترا",
        hint: "مجموعة كبيرة من الموسيقيين يعزفون على آلات موسيقية مختلفة."
    },
    {
        word: "البركان",
        hint: "جبل أو تل به فتحة تنطلق من خلالها الحمم البركانية وشظايا الصخور والبخار الساخن والغاز."
    },
    {
        word: "رواية",
        hint: "عمل روائي طويل، عادةً ما يكون له حبكة وشخصيات معقدة."
    },
    {
        word: "النحت",
        hint: "شكل فني ثلاثي الأبعاد تم إنشاؤه عن طريق تشكيل المواد أو الجمع بينها."
    },
    {
        word: "سمفونية",
        hint: "مقطوعة موسيقية طويلة لأوركسترا كاملة، عادة في حركات متعددة."
    },
    {
        word: "بناء",
        hint: "فن وعلم تصميم وتشييد المباني."
    },
    {
        word: "الباليه",
        hint: "شكل من أشكال الرقص الكلاسيكي يتميز بحركات دقيقة ورشيقة."
    },
    {
        word: "رائدفضاء",
        hint: "شخص مدرب على السفر والعمل في الفضاء."
    },
    {
        word: "شلال",
        hint: " الماء يسقط من ارتفاع عالي "
    },
    {
        word: "التكنولوجيا",
        hint: "تطبيق معرفه العلمية والابداعية"
    },
    {
        word: "قوسالمطر",
        hint: "ظاهرة جوية تنتج عن انعكاس الضوء وانكساره وتشتته."
    },
    {
        word: "الماء",
        hint: "مادة موجودة في كل مكان وزمان."
    },
    {
        word: "بيانو",
        hint: "آلة موسيقية يتم العزف عليها بالضغط على مفاتيح تؤدي إلى ضرب المطارق على الأوتار."
    },
    {
        word: "أجازة",
        hint: "فترة من الوقت مخصصة للمتعة أو الراحة أو الاسترخاء."
    },
    {
        word: "غابهاستوائيه",
        hint: "غابة كثيفة تتميز بكثرة هطول الأمطار والتنوع البيولوجي."
    },
    {
        word: "مسرح",
        hint: "مبنى أو منطقة خارجية تُعرض فيها المسرحيات أو الأفلام أو غيرها من العروض."
    },
    {
        word: "تليفون ",
        hint: "جهاز يستخدم لنقل الصوت لمسافات طويلة."
    },
    {
        word: "لغة",
        hint: "نظام اتصال يتكون من الكلمات والإيماءات وبناء الجملة."
    },
    {
        word: "الصحراء",
        hint: "أرض قاحلة أو قاحلة ذات أمطار قليلة أو معدومة."
    },
    {
        word: "دوارالشمس",
        hint: "نبات طويل القامة برأس زهرة صفراء كبيرة."
    },
    {
        word: "خيالي",
        hint: "نوع من الخيال العملي يتضمن عناصر سحرية وخارقة للطبيعة."
    },
    {
        word: "تيلسكوب",
        hint: "أداة بصرية تستخدم لرؤية الأجسام البعيدة في الفضاء."
    },
    {
        word: "نسيم",
        hint: "الرياح لطيف."
    },
    {
        word: "واحة",
        hint: "بقعة خصبة في الصحراء حيث يوجد الماء."
    },
    {
        word: "فتوغرافي",
        hint: "فن أو عملية أو ممارسة إنشاء الصور عن طريق تسجيل الضوء أو الإشعاع الكهرومغناطيسي الآخر."
    },
    {
        word: "مخيم",
        hint: "رحلة استكشافية أو رحلة، عادةً لمراقبة الحياة البرية في بيئتها الطبيعية."
    },
    {
        word: "القمر",
        hint: "جرم سماوي يدور حول الارض ولا يصدر ضوءا من نفسه."
    },
    {
        word: "نهر",
        hint: "مجرى طبيعي كبير من المياه يتدفق في قناة إلى البحر أو البحيرة أو أي مجرى آخر."
    },
    {
        word: "استوائي",
        hint: "تتعلق أو تقع في المنطقة الواقعة بين مدار السرطان ومدار الجدي."
    },
    {
        word: "غامض",
        hint: "من الصعب أو المستحيل فهمه أو شرحه أو تحديده."
    },
    {
        word: "لغز",
        hint: "شيء غامض أو محير أو يصعب فهمه."
    },
    {
        word: "عرموط",
        hint: "فاكهة دون نقاط في اسمها"
    },
    {
        word: "ضفدع",
        hint: "حيوان لايملك اسنان"
    },
    {
        word: "عكرشة",
        hint: "انثى الارنب تسمى"
    },
    {
        word: "الحلزون",
        hint: "حيوان خنثوي"
    },
    {
        word: "الاسبرين",
        hint: "سيد العقاقير الطبية."
    },
    {
        word: "ثلاث",
        hint: "كم اشعة يطلق اليورانيوم"
    },
    {
        word: "تحتالحمراء",
        hint: "موجات اطول من700نانومتر"
    },
    {
        word: "فوقالبنفسجية",
        hint: "اقوى الموجات تردد"
    },
    {
        word: "موجاتالراديو",
        hint: "اشعه تستخدم في تصوير المغناطيسي"
    },
    {
        word: "البولونيوم",
        hint: "اخطر العناصر الكيميائية"
    },
    {
        word: "سيليكون",
        hint: "عنصر كيمياء يحتوي على تكافئ عالي"
    },
    {
        word: "النتروجين",
        hint: "ثاني اكثر غاز قابل للانفجار"
    },
    {
        word: "الكحول",
        hint: "مواد سائلة قابلة للاشتعال"
    },
    {
        word: "كبريت",
        hint: "مواد صلبه تستخدم في الانفجارات"
    },
];